#ifndef __APP_VERSION_H__
#define __APP_VERSION_H__

#define DIWEN_VERSION		        (821)//未使用了,屏幕程序中直接固化
#define MCU_VERSION			        (711)//2025.07.11
/*《分类电子秤》 mcu version : 6.05
【一、功能需求】
1、血浆种类：P1~P4
2、献血者条码：15位，加'='共计16位
3、员工工号：4位
4、自动存储：（员工工号已录入 + 数据分类成功后 + 扫码献血者条码） 均满足后自动存储
5、数据筛选显示：类型 + 时间区间
6、数据导出：导出数据到U盘（所有 or 部分）
7、物理按键：去皮 + 主页/数据中心来回切
8、时间设置：显示时间
9、数据中心：显示今日数据 和 累计数量
10、存储采用小数存储，显示也采用小数显示
11、可以删除单条

【二、完成项】
1、完成，主页中点击血浆类型，进入选择页面后，点击选择，点击OK
2、完成
3、完成
4、完成
5、完成，待验证
6、完成
7、完成
8、完成
9、完成
10、完成
11、完成
【三、未完成项】
6、数据导出：
    数据中心页，《导出本页》

*/
#endif
